src/test/resources/request/xml_query.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cfec="http://www.fazenda.sp.gov.br/sat/wsdl/CfeConsultaLotes"><soapenv:Header><cfec:cfeCabecMsg><cfec:cUF>35</cfec:cUF><cfec:versaoDados>0.06</cfec:versaoDados></cfec:cfeCabecMsg></soapenv:Header><soapenv:Body><cfec:CfeConsultarLotes><cfec:cfeDadosMsg><![CDATA[<consLote xmlns="http://www.fazenda.sp.gov.br/sat" versao="0.06"><nserieSAT>999999999</nserieSAT><dhInicial>01042015000000</dhInicial><dhFinal>30042015004400</dhFinal><chaveSeguranca>24bb6087-3a03-4581-9b1f-4e8332879369</chaveSeguranca></consLote>]]></cfec:cfeDadosMsg></cfec:CfeConsultarLotes></soapenv:Body></soapenv:Envelope>